STMicroelectronics/STM32CubeMP2/Projects/STM32MP257F-DK/Templates/Template_StarterApp_M33TD/CM33/NonSecure/Core/Src/stm32mp2xx_hal_timebase_tim.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_timebase_TIM.c
  * @brief   HAL time base based on the hardware TIM.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"
#include "stm32mp2xx_hal_tim.h"
#include "stm32mp257f_disco.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef        htim6;
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

void HAL_DeInitTick(void);

/**
  * @brief  This function configures the TIM6 as a time base source.
  *         The time source is configured  to have 1ms time base with a dedicated
  *         Tick interrupt priority.
  * @note   This function is called  automatically at the beginning of program after
  *         reset by HAL_Init() or at any time when clock is configured, by HAL_RCC_ClockConfig().
  * @param  TickPriority: Tick interrupt priority.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{
  uint32_t              uwTimclock = 0;
  uint32_t              uwPrescalerValue = 0;
  HAL_StatusTypeDef     status;

  /* Acquire TIM6 using Resource manager */
  if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIFSC, RESMGR_RIFSC_TIM6_ID))
  {
    /* Compute TIM6 clock */
    uwTimclock = HAL_RCCEx_GetTimerCLKFreq(RCC_PERIPHCLK_TIM6);
    /* Compute the prescaler value to have TIM6 counter clock equal to 1MHz */
    uwPrescalerValue = (uint32_t) ((uwTimclock / 1000000U) - 1U);

    /* Initialize TIM6 */
    htim6.Instance = TIM6;

    /* Initialize TIMx peripheral as follow:
    + Period = [(TIM6CLK/1000) - 1]. to have a (1/1000) s time base.
    + Prescaler = (uwTimclock/1000000 - 1) to have a 1MHz counter clock.
    + ClockDivision = 0
    + Counter direction = Up
    */
    htim6.Init.Period = (1000000U / 1000U) - 1U;
    htim6.Init.Prescaler = uwPrescalerValue;
    htim6.Init.ClockDivision = 0;
    htim6.Init.CounterMode = TIM_COUNTERMODE_UP;

    status = HAL_TIM_Base_Init(&htim6);
    if (status == HAL_OK)
    {
      /* Start the TIM time Base generation in interrupt mode */
      status = HAL_TIM_Base_Start_IT(&htim6);
      if (status == HAL_OK)
      {
        if (TickPriority < (1UL << __NVIC_PRIO_BITS))
        {
          /* Enable the TIM6 global Interrupt */
          HAL_NVIC_SetPriority(TIM6_IRQn, TickPriority, 0U);
        }
        else
        {
          status = HAL_ERROR;
        }
      }
    }
    /* Enable the TIM6 global Interrupt */
    HAL_NVIC_EnableIRQ(TIM6_IRQn);
  }
  else
  {
    status = HAL_ERROR;
  }
 /* Return function status */
  return status;
}

/**
  * @brief  This function Disable the TIM6 as a time base source.
  * @param  None
  * @retval None
  */
void HAL_DeInitTick(void)
{
  HAL_TIM_Base_DeInit(&htim6);
  HAL_NVIC_DisableIRQ(TIM6_IRQn);
  /* Release TIM6 using Resource manager */
  (void) ResMgr_Release(RESMGR_RESOURCE_RIFSC, RESMGR_RIFSC_TIM6_ID);
}

/**
  * @brief  Suspend Tick increment.
  * @note   Disable the tick increment by disabling TIM6 update interrupt.
  * @param  None
  * @retval None
  */
void HAL_SuspendTick(void)
{
  /* Disable TIM6 update Interrupt */
  __HAL_TIM_DISABLE_IT(&htim6, TIM_IT_UPDATE);
}

/**
  * @brief  Resume Tick increment.
  * @note   Enable the tick increment by Enabling TIM6 update interrupt.
  * @param  None
  * @retval None
  */
void HAL_ResumeTick(void)
{
  /* Enable TIM6 Update interrupt */
  __HAL_TIM_ENABLE_IT(&htim6, TIM_IT_UPDATE);
}


